app/controllers/api/collections_controller.rb

    def index
      @collections = current_user.collections
                                 .page(params[:page])
                                 .per(4)
---
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 2]]

    def create
      @collection = current_user.collections.new(collection_params)

      if @collection.save
---
INSERT INTO "collections" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdfasfd"], ["description", "sdfasfgsagd      \r\n    "], ["user_id", 2], ["created_at", "2015-05-15 18:37:07.191232"], ["updated_at", "2015-05-15 18:37:07.191232"]]